app/views/houses/show.html.erb

<h1><% @house.name %></h1>
<% @house.students.each do |student| %>
---
SELECT "students".* FROM "students" WHERE "students"."house_id" = $1  [["house_id", 9]]